## pandas for begineer ##

In [14]:
import pandas as pd
import numpy as np

In [15]:
dict1={
    "name":["ayush","punam","smith","manish"],
    "age":[24,28,30,27],
    "occoupation":["s/w enginer","ca","manager","s/w enginer"]
}

In [16]:
df=pd.DataFrame(dict1)

In [17]:
df

     name  age  occoupation
0   ayush   24  s/w enginer
1   punam   28           ca
2   smith   30      manager
3  manish   27  s/w enginer

In [24]:
df.to_csv("brotherhood.csv",index=False)

In [26]:
df.head(2)

    name  age  occoupation
0  ayush   24  s/w enginer
1  punam   28           ca

In [27]:
df.tail()

     name  age  occoupation
0   ayush   24  s/w enginer
1   punam   28           ca
2   smith   30      manager
3  manish   27  s/w enginer

In [28]:
df.tail(1)

     name  age  occoupation
3  manish   27  s/w enginer

In [29]:
df.describe()

         age
count   4.00
mean   27.25
std     2.50
min    24.00
25%    26.25
50%    27.50
75%    28.50
max    30.00

In [30]:
family=pd.read_csv("family.csv")

In [31]:
family

     name  age  rollno
0   ayush   24       1
1   punam   28       2
2   smith   30       3
3  manish   27       4

In [32]:
family.tail(2)

     name  age  rollno
2   smith   30       3
3  manish   27       4

In [33]:
family.describe()

         age    rollno
count   4.00  4.000000
mean   27.25  2.500000
std     2.50  1.290994
min    24.00  1.000000
25%    26.25  1.750000
50%    27.50  2.500000
75%    28.50  3.250000
max    30.00  4.000000

In [43]:
type(family)

pandas.core.frame.DataFrame

In [41]:
family["age"][0]

10

In [37]:
family["age"][0]=10

C:\Users\AYU-PUN\AppData\Local\Temp\ipykernel_11776\1585459954.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  family["age"][0]=10

In [38]:
family

     name  age  rollno
0   ayush   10       1
1   punam   28       2
2   smith   30       3
3  manish   27       4

In [44]:
family

     name  age  rollno
0   ayush   10       1
1   punam   28       2
2   smith   30       3
3  manish   27       4

In [45]:
arr1=np.array(family)

In [46]:
arr1

array([['ayush', 10, 1],
       ['punam', 28, 2],
       ['smith', 30, 3],
       ['manish', 27, 4]], dtype=object)

In [47]:
family

     name  age  rollno
0   ayush   10       1
1   punam   28       2
2   smith   30       3
3  manish   27       4

In [48]:
family.to_numpy()

array([['ayush', 10, 1],
       ['punam', 28, 2],
       ['smith', 30, 3],
       ['manish', 27, 4]], dtype=object)

In [72]:
arr1=pd.DataFrame(np.random.rand(3,4))

In [73]:
arr1

          0         1         2         3
0  0.821352  0.787590  0.172677  0.174494
1  0.876044  0.185489  0.031676  0.276462
2  0.477234  0.893927  0.496793  0.250999

In [75]:
dict1

{'name': ['ayush', 'punam', 'smith', 'manish'],
 'age': [24, 28, 30, 27],
 'occoupation': ['s/w enginer', 'ca', 'manager', 's/w enginer']}

In [76]:
pd.Series(dict1)

name                     [ayush, punam, smith, manish]
age                                   [24, 28, 30, 27]
occoupation    [s/w enginer, ca, manager, s/w enginer]
dtype: object

In [78]:
ayush=pd.DataFrame(dict1)

In [79]:
ayush

     name  age  occoupation
0   ayush   24  s/w enginer
1   punam   28           ca
2   smith   30      manager
3  manish   27  s/w enginer

In [80]:
ayush.T

                       0      1        2            3
name               ayush  punam    smith       manish
age                   24     28       30           27
occoupation  s/w enginer     ca  manager  s/w enginer

In [82]:
ayush.shape

(4, 3)

In [87]:
ayush.size

12

In [88]:
type(ayush)

pandas.core.frame.DataFrame

In [89]:
dtype(ayush)

NameError: name 'dtype' is not defined

In [90]:
ayush

     name  age  occoupation
0   ayush   24  s/w enginer
1   punam   28           ca
2   smith   30      manager
3  manish   27  s/w enginer

In [92]:
ayush.sort_index(axis=0,ascending=False)

     name  age  occoupation
3  manish   27  s/w enginer
2   smith   30      manager
1   punam   28           ca
0   ayush   24  s/w enginer

In [93]:
ayush

     name  age  occoupation
0   ayush   24  s/w enginer
1   punam   28           ca
2   smith   30      manager
3  manish   27  s/w enginer

In [99]:
ayush.loc[0,"name"]

'ayush'

In [102]:
ayush.drop("age",axis=1)

     name  occoupation
0   ayush  s/w enginer
1   punam           ca
2   smith      manager
3  manish  s/w enginer

In [109]:
ayush

     name  occoupation
0   ayush  s/w enginer
1   punam           ca
2   smith      manager
3  manish  s/w enginer

In [130]:
ayush.rename({"name":"nam","occoupation":"kam"},axis=1)

      nam          kam
0   ayush  s/w enginer
1   punam           ca
2   smith      manager
3  manish  s/w enginer